|...+.*..1....+....2....+....3....+....4....+....5....+....6....+....7..
       01  TEST-TABLE-01.
           05  Z               PICTURE 99V99.
           05  A PICTURE X(6).
           05  B REDEFINES A.
               10 B-1          PICTURE X(2).
               10 B-2          PICTURE 9(4).
           05  C               PICTURE 99V99.
