|...+.*..1....+....2....+....3....+....4....+....5....+....6....+....7..
       01  TEST-TABLE-02.
           05  Z      PIC X(4).
           05  A.
               10 A-1 PIC X(2).
               10 A-2 PIC X(4).
           05  B REDEFINES A.
               10 B-1.
                   15 B-1-1 PIC X(1).
                   15 B-1-2 PIC X(1).
               10 B-2 PIC X(4).
           05  C.
               10 C-1 PIC X(2).
               10 C-2 PIC X(4).